In [1]:
import pandas as pd

### Creation of DataFrame

In [91]:
df = pd.DataFrame(data={"A":[1,1,1,2,3,4]})
df

   A
0  1
1  1
2  1
3  2
4  3
5  4

In [3]:
df_2d = pd.DataFrame(data=[[1,2,3], [4,5,6]], columns=["col1", "col2", "col3"])
df_2d

   col1  col2  col3
0     1     2     3
1     4     5     6

In [4]:
d_tupe = [
    ('Age', [23,35,43,45]),
    ('Team', [23,56,34,67]),
    ('Score',[1,45,74,32])
]
pd.DataFrame.from_records(d_tupe)

       0                 1
0    Age  [23, 35, 43, 45]
1   Team  [23, 56, 34, 67]
2  Score   [1, 45, 74, 32]

In [5]:
data1 = [{'Geeks': 'dataframe', 'For': 'using', 'geeks': 'list'},
        {'Geeks':10, 'For': 20, 'geeks': 30}]
 
df_list_of_dict = pd.DataFrame.from_records(data1)
df_list_of_dict

       Geeks    For geeks
0  dataframe  using  list
1         10     20    30

In [6]:
df_list_of_dict2 = pd.DataFrame.from_dict(data1)
df_list_of_dict2

       Geeks    For geeks
0  dataframe  using  list
1         10     20    30

### replaceing string value using regex

In [7]:
df_list_of_dict2.replace(to_replace='[i]', value='p', regex=True)

       Geeks    For geeks
0  dataframe  uspng  lpst
1         10     20    30

### Unique values

- unique - unique values
- nunique - count of unique vales
- value_counts - appearance of each values how many time

In [92]:
df["A"].unique()

array([1, 2, 3, 4])

In [8]:
# count of unique values
df["A"].nunique()

4

In [9]:
df["A"].value_counts()

1    3
4    1
3    1
2    1
Name: A, dtype: int64

In [10]:
df["A"].value_counts().index

Int64Index([1, 4, 3, 2], dtype='int64')

### Merge

 - on
 - how: left, right, inner, outer, cross
 
### Join
 - allows only to join on the basis on index where as merge allows join on columns and indexes

In [11]:
# merge
df1 = pd.DataFrame(data={"Id": [1,2,3], "Name": ["Akash1", "Akash2", "Akash3"]})
df2 = pd.DataFrame(data={"Id": [1,2], "Address": ["add1", "add2"]})
dfMerge = pd.merge(df1, df2, on="Id", how="right") # left, right, inner, outer, cross
dfMerge

   Id    Name Address
0   1  Akash1    add1
1   2  Akash2    add2

In [12]:
df3 = pd.DataFrame(data={"Name": ["Akash", "Akash", "Akash", "Sumit", "Sumit", "Vatsal"],
                         "Subject": ["Maths", "Physics", "English", "Maths", "Physics", "English"],
                         "Marks": [80,50, 70, 20, 30,20]
                        })
df3

     Name  Subject  Marks
0   Akash    Maths     80
1   Akash  Physics     50
2   Akash  English     70
3   Sumit    Maths     20
4   Sumit  Physics     30
5  Vatsal  English     20

## Group by
#### column creation - 
- constant
- using other columns

In [13]:
df3.groupby("Subject").sum()

         Marks
Subject
English     90
Maths      100
Physics     80

In [14]:
df3["TotalMarks"] = 100
df3

     Name  Subject  Marks  TotalMarks
0   Akash    Maths     80         100
1   Akash  Physics     50         100
2   Akash  English     70         100
3   Sumit    Maths     20         100
4   Sumit  Physics     30         100
5  Vatsal  English     20         100

In [15]:
import numpy as np
df3.groupby(["Name", "Subject"]).agg({"Marks": sum, "TotalMarks": np.average})

                Marks  TotalMarks
Name   Subject
Akash  English     70         100
       Maths       80         100
       Physics     50         100
Sumit  Maths       20         100
       Physics     30         100
Vatsal English     20         100

In [93]:
df4 = df3.groupby("Name").sum()
df4

        Marks  TotalMarks
Name
Akash     200         300
Sumit      50         200
Vatsal     20         100

In [94]:
df4["percentage"] = df4["Marks"] / df4["TotalMarks"]
df4

        Marks  TotalMarks  percentage
Name
Akash     200         300    0.666667
Sumit      50         200    0.250000
Vatsal     20         100    0.200000

### Drop / sort / empty

In [95]:
df4.empty

False

In [97]:
df4.drop(["percentage"], axis=1)

        Marks  TotalMarks
Name
Akash     200         300
Sumit      50         200
Vatsal     20         100

In [20]:
df4.sort_values("Marks", inplace=True, ascending=True)
df4

        Marks  TotalMarks  percentage
Name
Vatsal     20         100    0.200000
Sumit      50         200    0.250000
Akash     200         300    0.666667

In [21]:
dfstrip = pd.DataFrame(data={"Akash": ["1 ","2aa ","3   ","  4  "]})
dfstrip

   Akash
0     1
1   2aa
2   3
3    4

In [22]:
dfstrip["Akash"].str.strip()

0      1
1    2aa
2      3
3      4
Name: Akash, dtype: object

### Filter

In [23]:
dffilter = pd.DataFrame(data={"Id": [1,2,3,4,5,5,6,7,8,10,9], "People": [123,213,4564,678,546,4564,567,234,23,42,34]})

dffilter.query("Id>7")

    Id  People
8    8      23
9   10      42
10   9      34

In [24]:
dffilter[dffilter["Id"]>7]

    Id  People
8    8      23
9   10      42
10   9      34

In [25]:
dffilter[(dffilter["Id"]==5) | (dffilter["Id"]==1)]  # or condition

   Id  People
0   1     123
4   5     546
5   5    4564

### Apply

- axis = 0: column
- axis = 1: row

In [26]:
dffilter.apply(np.sum, axis=0)

Id           60
People    11588
dtype: int64

In [27]:
dffilter.apply(np.sum, axis=1)

0      124
1      215
2     4567
3      682
4      551
5     4569
6      573
7      241
8       31
9       52
10      43
dtype: int64

In [100]:
dffilter.applymap(lambda x: x**2)

     Id    People
0     4     15129
1     9     45369
2    16  20830096
3    25    459684
4    36    298116
5    36  20830096
6    49    321489
7    64     54756
8    81       529
9   121      1764
10  100      1156

In [29]:
dffilter['Id'] = dffilter['Id'].apply(lambda x: x + 1)
dffilter

    Id  People
0    2     123
1    3     213
2    4    4564
3    5     678
4    6     546
5    6    4564
6    7     567
7    8     234
8    9      23
9   11      42
10  10      34

In [30]:
def is_even(x):
    return x%2==0

# convert to vectorised numpy method
is_even_vectorized = np.vectorize(is_even)

# apply method
p = is_even_vectorized(dffilter["Id"])
print(p)

# get only those rows where value is true
dffilter.iloc[p]

# dffilter.loc[dffilter.filter(is_even(dffilter["Id"]))]

[ True False  True False  True  True False  True False False  True]

    Id  People
0    2     123
2    4    4564
4    6     546
5    6    4564
7    8     234
10  10      34

### loc, iloc
The main distinction between the two methods is:

loc gets rows (and/or columns) with particular labels.

iloc gets rows (and/or columns) at integer locations.

To demonstrate, consider a series s of characters with a non-monotonic integer index:

s = pd.Series(list("abcdef"), index=[49, 48, 47, 0, 1, 2]) 
49    a
48    b
47    c
0     d
1     e
2     f

s.loc[0]    # value at index label 0
'd'

s.iloc[0]   # value at index location 0
'a'

s.loc[0:1]  # rows at index labels between 0 and 1 (inclusive)
0    d
1    e

s.iloc[0:1] # rows at index location between 0 and 1 (exclusive)
49    a

In [31]:
dffilter.loc[dffilter["People"]> 500, ["Id"]] # filter on column people get column id

   Id
2   4
3   5
4   6
5   6
6   7

In [32]:
dfloc = pd.DataFrame([[1, 2], [4, 5], [7, 8]],index=['cobra', 'viper', 'sidewinder'], columns=['max_speed', 'shield'])
dfloc

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [33]:
dfloc["max_speed"]

cobra         1
viper         4
sidewinder    7
Name: max_speed, dtype: int64

In [34]:
dfloc[["max_speed"]]

            max_speed
cobra               1
viper               4
sidewinder          7

In [35]:
dffilter.iloc[0]

Id          2
People    123
Name: 0, dtype: int64

In [36]:
dffilter.iloc[0:5]

   Id  People
0   2     123
1   3     213
2   4    4564
3   5     678
4   6     546

In [37]:
dffilter.iloc[lambda x: x.index % 2 == 0]

    Id  People
0    2     123
2    4    4564
4    6     546
6    7     567
8    9      23
10  10      34

In [38]:
"""

Filtering based on column

def is_even(x):
    return x%2==0

# convert to vectorised numpy method
is_even_vectorized = np.vectorize(is_even)

# apply method
p = is_even_vectorized(dffilter["Id"])
print(p)

# get only those rows where value is true
dffilter.iloc[p]
"""

'\n\nFiltering based on column\n\ndef is_even(x):\n    return x%2==0\n\n# convert to vectorised numpy method\nis_even_vectorized = np.vectorize(is_even)\n\n# apply method\np = is_even_vectorized(dffilter["Id"])\nprint(p)\n\n# get only those rows where value is true\ndffilter.iloc[p]\n'

In [39]:
dffilter.iloc[0, 1]  # 0 row 1st column

123

In [40]:
dffilter.iloc[0:5, 1] # 0-4 row and 1st column

0     123
1     213
2    4564
3     678
4     546
Name: People, dtype: int64

In [41]:
ap = np.array(["a", "k", "a", "s", "h"])
ser = pd.Series(ap, index=["10", "11", "12", "13", "14"])
ser

10    a
11    k
12    a
13    s
14    h
dtype: object

In [42]:
my_dict = {'a': 1, 'b':2, 'c': 3}
ser1 = pd.Series(my_dict)
ser1

a    1
b    2
c    3
dtype: int64

In [43]:
df_series = pd.DataFrame({"one": pd.Series(["1","2","3"]), "two": pd.Series(["4","4","6"])}, index=[1,1,2,3])
df_series

   one  two
1    2    4
1    2    4
2    3    6
3  NaN  NaN

In [44]:
df_series.loc[:2]

  one two
1   2   4
1   2   4
2   3   6

In [45]:
for index, row in df_series.iterrows():
    print(index,row["one"], row["two"])

1 2 4
1 2 4
2 3 6
3 nan nan

###  fillna vs interpolate
- fillna: allows to fill static values
- interpolate: allows to interpolate based on linear, time etc

In [46]:
df_series.fillna(1, inplace=True)

In [47]:
df_series

  one two
1   2   4
1   2   4
2   3   6
3   1   1

In [48]:
 # insert row at bottom
df_series.loc[len(df_series.index)] = [8, 8]
df_series

  one two
1   2   4
1   2   4
2   3   6
3   1   1
4   8   8

In [49]:
df_series["three"] = [1,2,3,4,5]
df_series

  one two  three
1   2   4      1
1   2   4      2
2   3   6      3
3   1   1      4
4   8   8      5

### percentile quantile

In [50]:
df_series.three.quantile(0.9)  # 90th percentile

4.6

In [51]:
# change column datatype
df_series["one"] = df_series["one"].apply(pd.to_numeric)
df_series

   one two  three
1    2   4      1
1    2   4      2
2    3   6      3
3    1   1      4
4    8   8      5

In [52]:
df_series.astype({"one": int})

   one two  three
1    2   4      1
1    2   4      2
2    3   6      3
3    1   1      4
4    8   8      5

In [53]:
df_series.drop([4], inplace=True)
df_series

   one two  three
1    2   4      1
1    2   4      2
2    3   6      3
3    1   1      4

In [54]:
df_series.drop(["three"], axis=1, inplace=True)
df_series

   one two
1    2   4
1    2   4
2    3   6
3    1   1

### iteration pandas

In [55]:
for index, row in df_series.iterrows():
    print(index, dict(row))

1 {'one': 2, 'two': '4'}
1 {'one': 2, 'two': '4'}
2 {'one': 3, 'two': '6'}
3 {'one': 1, 'two': 1}

In [56]:
for i in range(len(df_series)):
    print(i)
    print(df_series.iloc[i, 0:2])  # 0th column
    print("----")

0
one    2
two    4
Name: 1, dtype: object
----
1
one    2
two    4
Name: 1, dtype: object
----
2
one    3
two    6
Name: 2, dtype: object
----
3
one    1
two    1
Name: 3, dtype: object
----

In [57]:
df_series.iloc[0]

one    2
two    4
Name: 1, dtype: object

### drop using index

In [58]:
index_to_drop = df_series[df_series["one"] > 1].index
index_to_drop

Int64Index([1, 1, 2], dtype='int64')

In [59]:
df_series.drop(index_to_drop, axis=0)

   one two
3    1   1

In [60]:
# Create a dictionary with student details
student_details = {'Name':['Raj', 'Raj', 'Raj', 'Aravind', 'Aravind', 'Aravind',
							'John', 'John', 'John', 'Arjun', 'Arjun', 'Arjun'],
				'Subject':['Maths', 'Physics', 'Chemistry', 'Maths', 'Physics',
							'Chemistry', 'Maths', 'Physics', 'Chemistry', 'Maths',
														'Physics', 'Chemistry'],
				'Marks':[80, 90, 75, 60, 40, 60, 80, 55, 100, 90, 75, 70]
			}

# Convert dictionary to a DataFrame
df = pd.DataFrame(student_details)
print(df)

       Name    Subject  Marks
0       Raj      Maths     80
1       Raj    Physics     90
2       Raj  Chemistry     75
3   Aravind      Maths     60
4   Aravind    Physics     40
5   Aravind  Chemistry     60
6      John      Maths     80
7      John    Physics     55
8      John  Chemistry    100
9     Arjun      Maths     90
10    Arjun    Physics     75
11    Arjun  Chemistry     70

In [61]:
df['Mark_Rank'] = df['Marks'].rank(ascending = 0)
df

       Name    Subject  Marks  Mark_Rank
0       Raj      Maths     80        4.5
1       Raj    Physics     90        2.5
2       Raj  Chemistry     75        6.5
3   Aravind      Maths     60        9.5
4   Aravind    Physics     40       12.0
5   Aravind  Chemistry     60        9.5
6      John      Maths     80        4.5
7      John    Physics     55       11.0
8      John  Chemistry    100        1.0
9     Arjun      Maths     90        2.5
10    Arjun    Physics     75        6.5
11    Arjun  Chemistry     70        8.0

In [62]:
df = df.set_index('Mark_Rank')
df

              Name    Subject  Marks
Mark_Rank
4.5            Raj      Maths     80
2.5            Raj    Physics     90
6.5            Raj  Chemistry     75
9.5        Aravind      Maths     60
12.0       Aravind    Physics     40
9.5        Aravind  Chemistry     60
4.5           John      Maths     80
11.0          John    Physics     55
1.0           John  Chemistry    100
2.5          Arjun      Maths     90
6.5          Arjun    Physics     75
8.0          Arjun  Chemistry     70

In [63]:
df.sort_index()

              Name    Subject  Marks
Mark_Rank
1.0           John  Chemistry    100
2.5            Raj    Physics     90
2.5          Arjun      Maths     90
4.5            Raj      Maths     80
4.5           John      Maths     80
6.5            Raj  Chemistry     75
6.5          Arjun    Physics     75
8.0          Arjun  Chemistry     70
9.5        Aravind      Maths     60
9.5        Aravind  Chemistry     60
11.0          John    Physics     55
12.0       Aravind    Physics     40

In [64]:
df.sort_values(by=["Marks", "Mark_Rank"], inplace=True, ascending=True)
df

              Name    Subject  Marks
Mark_Rank
12.0       Aravind    Physics     40
11.0          John    Physics     55
9.5        Aravind      Maths     60
9.5        Aravind  Chemistry     60
8.0          Arjun  Chemistry     70
6.5            Raj  Chemistry     75
6.5          Arjun    Physics     75
4.5            Raj      Maths     80
4.5           John      Maths     80
2.5            Raj    Physics     90
2.5          Arjun      Maths     90
1.0           John  Chemistry    100

In [65]:
df.max()

Name           Raj
Subject    Physics
Marks          100
dtype: object

In [66]:
df[df["Subject"] == df["Subject"].min()]

              Name    Subject  Marks
Mark_Rank
9.5        Aravind  Chemistry     60
8.0          Arjun  Chemistry     70
6.5            Raj  Chemistry     75
1.0           John  Chemistry    100

In [67]:
df[df["Name"] == df["Name"].max()]

          Name    Subject  Marks
Mark_Rank
6.5        Raj  Chemistry     75
4.5        Raj      Maths     80
2.5        Raj    Physics     90

## substring

In [68]:
# importing pandas module
import pandas as pd
	
# making data frame
df = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")


df1 = df[df['Team'].str.contains('Boston') & df['Position'].str.contains('PG')]
df1

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0

### Columns

In [69]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [70]:
df.rename(columns={"Number": "Number1"}, inplace=True)
df.head()

,Name,Team,Number1,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [71]:
df["Position"].nunique()
df["Position"].value_counts()

SG    102
PF    100
PG     92
SF     85
C      78
Name: Position, dtype: int64

In [72]:
df["Position"].unique()

array(['PG', 'SF', 'SG', 'PF', 'C', nan], dtype=object)

In [73]:
df["coustom"] = df["Weight"] - df["Number1"]
df.head()

,Name,Team,Number1,Position,Age,Height,Weight,College,Salary,coustom
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,180.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,136.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,175.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,157.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,223.0

In [74]:
dfp = df.set_index("Name")
dfp.head()

,Team,Number1,Position,Age,Height,Weight,College,Salary,coustom
Name,,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,180.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,136.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,175.0
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,157.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,223.0

In [75]:
dfp[dfp["Age"] < 27].index.tolist()

['Avery Bradley',
 'Jae Crowder',
 'R.J. Hunter',
 'Jordan Mickey',
 'Kelly Olynyk',
 'Terry Rozier',
 'Marcus Smart',
 'Jared Sullinger',
 'James Young',
 'Tyler Zeller',
 'Markel Brown',
 'Rondae Hollis-Jefferson',
 'Sergey Karasev',
 'Sean Kilpatrick',
 'Shane Larkin',
 'Chris McCullough',
 'Willie Reed',
 'Thomas Robinson',
 'Henry Sims',
 'Thanasis Antetokounmpo',
 'Cleanthony Early',
 'Langston Galloway',
 'Jerian Grant',
 "Kyle O'Quinn",
 'Kristaps Porzingis',
 'Kevin Seraphin',
 'Derrick Williams',
 'Tony Wroten',
 'Isaiah Canaan',
 'Robert Covington',
 'Joel Embiid',
 'Jerami Grant',
 'Richaun Holmes',
 'Kendall Marshall',
 'T.J. McConnell',
 'Nerlens Noel',
 'Jahlil Okafor',
 'Nik Stauskas',
 'Hollis Thompson',
 'Christian Wood',
 'Bismack Biyombo',
 'Bruno Caboclo',
 'DeMar DeRozan',
 'Cory Joseph',
 'Lucas Nogueira',
 'Norman Powell',
 'Terrence Ross',
 'Jonas Valanciunas',
 'Delon Wright',
 'Harrison Barnes',
 'Ian Clark',
 'Festus Ezeli',
 'Draymond Green',
 'Kevon Looney',
 'James Michael McAdoo',
 'Klay Thompson',
 'Branden Dawson',
 'Austin Rivers',
 'C.J. Wilcox',
 'Tarik Black',
 'Anthony Brown',
 'Jordan Clarkson',
 'Ryan Kelly',
 'Larry Nance Jr.',
 'Julius Randle',
 "D'Angelo Russell",
 'Eric Bledsoe',
 'Devin Booker',
 'Archie Goodwin',
 'John Jenkins',
 'Brandon Knight',
 'Alex Len',
 'Phil Pressey',
 'T.J. Warren',
 'Alan Williams',
 'Quincy Acy',
 'Willie Cauley-Stein',
 'DeMarcus Cousins',
 'Seth Curry',
 'Duje Dukan',
 'Ben McLemore',
 'Eric Moreland',
 'Cameron Bairstow',
 'Jimmy Butler',
 'Cristiano Felicio',
 'Doug McDermott',
 'Nikola Mirotic',
 'Bobby Portis',
 'Tony Snell',
 'Matthew Dellavedova',
 'Kyrie Irving',
 'Jordan McRae',
 'Iman Shumpert',
 'Tristan Thompson',
 'Lorenzo Brown',
 'Reggie Bullock',
 'Kentavious Caldwell-Pope',
 'Spencer Dinwiddie',
 'Andre Drummond',
 'Tobias Harris',
 'Darrun Hilliard',
 'Reggie Jackson',
 'Stanley Johnson',
 'Marcus Morris',
 'Rakeem Christmas',
 'Paul George',
 'Solomon Hill',
 'Glenn Robinson III',
 'Myles Turner',
 'Shayne Whittington',
 'Joe Young',
 'Giannis Antetokounmpo',
 'Michael Carter-Williams',
 'Jared Cunningham',
 'Tyler Ennis',
 'John Henson',
 'Damien Inglis',
 'Khris Middleton',
 'Greg Monroe',
 "Johnny O'Bryant III",
 'Jabari Parker',
 'Rashad Vaughn',
 'Justin Anderson',
 'Dwight Powell',
 'Clint Capela',
 'Sam Dekker',
 'James Harden',
 'Montrezl Harrell',
 'Terrence Jones',
 'K.J. McDaniels',
 'Donatas Motiejunas',
 'Jordan Adams',
 'Bryce Cotton',
 'JaMychal Green',
 'P.J. Hairston',
 'Jarell Martin',
 'Ray McCallum',
 'Xavier Munford',
 'Lance Stephenson',
 'Luke Babbitt',
 'Anthony Davis',
 'Bryce Dejean-Jones',
 'James Ennis',
 'Tyreke Evans',
 'Tim Frazier',
 'Jordan Hamilton',
 'Jrue Holiday',
 'Kyle Anderson',
 'Kawhi Leonard',
 'Jonathon Simmons',
 'Kent Bazemore',
 'Tim Hardaway Jr.',
 'Mike Muscala',
 'Lamar Patterson',
 'Dennis Schroder',
 'Walter Tavares',
 'Troy Daniels',
 'Aaron Harrison',
 'Frank Kaminsky III',
 'Michael Kidd-Gilchrist',
 'Jeremy Lamb',
 'Kemba Walker',
 'Cody Zeller',
 'Tyler Johnson',
 'Josh Richardson',
 'Briante Weber',
 'Hassan Whiteside',
 'Justise Winslow',
 'Dewayne Dedmon',
 'Evan Fournier',
 'Aaron Gordon',
 'Mario Hezonja',
 'Brandon Jennings',
 'Devyn Marble',
 'Shabazz Napier',
 'Andrew Nicholson',
 'Victor Oladipo',
 'Elfrid Payton',
 'Nikola Vucevic',
 'Bradley Beal',
 'Jarell Eddie',
 'Markieff Morris',
 'Kelly Oubre Jr.',
 'Otto Porter Jr.',
 'John Wall',
 'Will Barton',
 'Kenneth Faried',
 'Gary Harris',
 'Nikola Jokic',
 'Joffrey Lauvergne',
 'Emmanuel Mudiay',
 'Jusuf Nurkic',
 'JaKarr Sampson',
 'Axel Toupane',
 'Gorgui Dieng',
 'Tyus Jones',
 'Zach LaVine',
 'Shabazz Muhammad',
 'Adreian Payne',
 'Ricky Rubio',
 'Greg Smith',
 'Karl-Anthony Towns',
 'Andrew Wiggins',
 'Steven Adams',
 'Josh Huestis',
 'Serge Ibaka',
 'Enes Kanter',
 'Mitch McGary',
 'Cameron Payne',
 'Andre Roberson',
 'Dion Waiters',
 'Cliff Alexander',
 'Al-Farouq Aminu',
 'Pat Connaughton',
 'Allen Crabbe',
 'Maurice Harkless',
 'Meyers Leonard',
 'Damian Lillard',
 'C.J. McCollum',
 'Luis Montero',
 'Mason Plumlee',
 'Noah Vonleh',
 'Trey Burke',
 'Alec Burks',
 'Dante Exum',
 'Derrick Favors',
 'Rudy Gobert',
 'Gordon Hayward',
 'Rodney Hood',
 'Chris Johnson',
 'Trey Lyles',
 'Shelvin Mack',
 'Raul Neto',
 'Tibor Pleiss',
 'Jeff Withey']

### Replace values in dataframe

In [76]:
changes = {"Boston Celtics": "Replaced Name"}
dfp.replace({"Team": changes}, inplace=True)
dfp.head()

,Team,Number1,Position,Age,Height,Weight,College,Salary,coustom
Name,,,,,,,,,
Avery Bradley,Replaced Name,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,180.0
Jae Crowder,Replaced Name,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,136.0
John Holland,Replaced Name,30.0,SG,27.0,6-5,205.0,Boston University,NaN,175.0
R.J. Hunter,Replaced Name,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,157.0
Jonas Jerebko,Replaced Name,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,223.0

In [77]:
dfp["Team"].str.split(' ').str[0]

Name
Avery Bradley    Replaced
Jae Crowder      Replaced
John Holland     Replaced
R.J. Hunter      Replaced
Jonas Jerebko    Replaced
                   ...
Shelvin Mack         Utah
Raul Neto            Utah
Tibor Pleiss         Utah
Jeff Withey          Utah
NaN                   NaN
Name: Team, Length: 458, dtype: object

In [78]:
dfp['Weight'] = dfp['Height'].str.extract('(\d\-\d)', expand=True)
dfp

,Team,Number1,Position,Age,Height,Weight,College,Salary,coustom
Name,,,,,,,,,
Avery Bradley,Replaced Name,0.0,PG,25.0,6-2,6-2,Texas,7730337.0,180.0
Jae Crowder,Replaced Name,99.0,SF,25.0,6-6,6-6,Marquette,6796117.0,136.0
John Holland,Replaced Name,30.0,SG,27.0,6-5,6-5,Boston University,NaN,175.0
R.J. Hunter,Replaced Name,28.0,SG,22.0,6-5,6-5,Georgia State,1148640.0,157.0
Jonas Jerebko,Replaced Name,8.0,PF,29.0,6-10,6-1,NaN,5000000.0,223.0
...,...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,6-3,Butler,2433333.0,195.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,6-1,NaN,900000.0,154.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,7-3,NaN,2900000.0,235.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,7-0,Kansas,947276.0,207.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [79]:
df.dtypes

Name         object
Team         object
Number1     float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
coustom     float64
dtype: object

In [80]:
 # sample dataframe
dfe = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': ['a', 'b', 'c', 'd', 'e'],
    'C': [1.1, '1.0', '1.3', 2, 5]})
 
# using dictionary to convert specific columns
convert_dict = {'A': int,
                'C': float
                }
 
dfe = dfe.astype(convert_dict)
print(dfe.dtypes)

A      int64
B     object
C    float64
dtype: object

### Create two column splitting one column

In [81]:
dfp["Akash"] = ["Akash Gupta"]*458
dfp[["teamNAme 1", "teamName 2"]] = dfp["Akash"].str.split(' ', expand=True)
dfp.head()

,Team,Number1,Position,Age,Height,Weight,College,Salary,coustom,Akash,teamNAme 1,teamName 2
Name,,,,,,,,,,,,
Avery Bradley,Replaced Name,0.0,PG,25.0,6-2,6-2,Texas,7730337.0,180.0,Akash Gupta,Akash,Gupta
Jae Crowder,Replaced Name,99.0,SF,25.0,6-6,6-6,Marquette,6796117.0,136.0,Akash Gupta,Akash,Gupta
John Holland,Replaced Name,30.0,SG,27.0,6-5,6-5,Boston University,NaN,175.0,Akash Gupta,Akash,Gupta
R.J. Hunter,Replaced Name,28.0,SG,22.0,6-5,6-5,Georgia State,1148640.0,157.0,Akash Gupta,Akash,Gupta
Jonas Jerebko,Replaced Name,8.0,PF,29.0,6-10,6-1,NaN,5000000.0,223.0,Akash Gupta,Akash,Gupta

In [82]:
df.iloc[df[df["Age"] == df["Age"].max()].index]

,Name,Team,Number1,Position,Age,Height,Weight,College,Salary,coustom
298,Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0,229.0
304,Andre Miller,San Antonio Spurs,24.0,PG,40.0,6-3,200.0,Utah,250750.0,176.0
400,Kevin Garnett,Minnesota Timberwolves,21.0,PF,40.0,6-11,240.0,NaN,8500000.0,219.0

In [83]:
df[df["Age"] == df["Age"].min()]

,Name,Team,Number1,Position,Age,Height,Weight,College,Salary,coustom
122,Devin Booker,Phoenix Suns,1.0,SG,19.0,6-6,206.0,Kentucky,2127840.0,205.0
226,Rashad Vaughn,Milwaukee Bucks,20.0,SG,19.0,6-6,202.0,UNLV,1733040.0,182.0

In [84]:
df["Age"].nlargest(10)

298    40.0
304    40.0
400    40.0
102    39.0
261    39.0
101    38.0
256    38.0
299    38.0
420    38.0
46     37.0
Name: Age, dtype: float64

In [85]:
df["Age"].nsmallest(10)

122    19.0
226    19.0
13     20.0
40     20.0
56     20.0
60     20.0
62     20.0
85     20.0
116    20.0
192    20.0
Name: Age, dtype: float64

In [86]:
dfp.drop(["teamName 2"], axis=1)

,Team,Number1,Position,Age,Height,Weight,College,Salary,coustom,Akash,teamNAme 1
Name,,,,,,,,,,,
Avery Bradley,Replaced Name,0.0,PG,25.0,6-2,6-2,Texas,7730337.0,180.0,Akash Gupta,Akash
Jae Crowder,Replaced Name,99.0,SF,25.0,6-6,6-6,Marquette,6796117.0,136.0,Akash Gupta,Akash
John Holland,Replaced Name,30.0,SG,27.0,6-5,6-5,Boston University,NaN,175.0,Akash Gupta,Akash
R.J. Hunter,Replaced Name,28.0,SG,22.0,6-5,6-5,Georgia State,1148640.0,157.0,Akash Gupta,Akash
Jonas Jerebko,Replaced Name,8.0,PF,29.0,6-10,6-1,NaN,5000000.0,223.0,Akash Gupta,Akash
...,...,...,...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,6-3,Butler,2433333.0,195.0,Akash Gupta,Akash
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,6-1,NaN,900000.0,154.0,Akash Gupta,Akash
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,7-3,NaN,2900000.0,235.0,Akash Gupta,Akash
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,7-0,Kansas,947276.0,207.0,Akash Gupta,Akash
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Akash Gupta,Akash